tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
brew "erlang"
brew "elixir"
brew "fd"
brew "git"
brew "libfido2"
brew "mysql"
brew "neovim"
brew "node@14"
brew "openjdk"
brew "php"
brew "postgresql@13", restart_service: true, link: true
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "wget"
brew "heroku/brew/heroku"
brew "mongodb/brew/mongodb-community"
cask "discord"
cask "figma"
cask "google-chrome"
cask "iterm2"
cask "postman"
cask "rectangle"
cask "slack"
cask "obsidian"
cask "telegram"
cask "visual-studio-code"
