tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
brew "fzf"
brew "gh"
brew "go"
brew "jenkins-lts"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "kops"
brew "maven"
brew "mysql"
brew "neofetch"
brew "neovim"
brew "openssl@1.1"
brew "redis", restart_service: true
brew "ripgrep"
brew "terraform-docs"
brew "tmux"
brew "wget"
brew "tree"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
cask "figma"
cask "google-chrome"
cask "iterm2"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "obsidian"
cask "postman"
cask "rectangle"
cask "spotify"
cask "timche-gmail-desktop"
cask "visual-studio-code"
vscode "Catppuccin.catppuccin-vsc"
vscode "esbenp.prettier-vscode"
vscode "Hridoy.gsap-snippets"
vscode "jdinhlife.gruvbox"
vscode "Meezilla.json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.java"
vscode "ritwickdey.LiveServer"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
