tap "tinygo-org/tools"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "ccache"
brew "cmake"
brew "docker"
brew "dockerfile-language-server"
brew "etcd"
brew "git"
brew "go"
brew "gopls"
brew "lua-language-server"
brew "nasm"
brew "neovim", args: ["HEAD"]
brew "ninja"
brew "pkgconf"
brew "postgresql@14", restart_service: :changed
brew "pyright"
brew "ripgrep"
brew "rust-analyzer"
brew "skopeo"
brew "subversion"
brew "terraform-ls"
brew "tmux"
brew "vscode-langservers-extracted"
brew "yaml-language-server"
brew "zls"
brew "tinygo-org/tools/tinygo"
cask "brave-browser"
cask "visual-studio-code"
vscode "aryanahire.sublime-monokai"
vscode "azapi-vscode.azapi"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hridoy.gsap-snippets"
vscode "jdinhlife.gruvbox"
vscode "jprestidge.theme-material-theme"
vscode "meezilla.json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.powershell"
vscode "qufiwefefwoyn.kanagawa"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "tauri-apps.tauri-vscode"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "yurihs.sublime-vscode-theme"
